class Translation(object):

    START_TEXT = """مرحبا,

مرحبا انا upload bot يمكنني تحميل اي ملف تريده الي تيليجرام!

<b>ارسل لي اي رابط مباشر و ساقوم بتحميله الي تيليجرام, نقدر نحمل لك الملفات الي تيليجرام كا ملف/فيديو</b>

/help للمزيد من التفاصيل..

جروب الدعم : @TroJanzSupport
"""

    HELP_USER = """مرحبا انا upload bot ..
    
1. ارسل url (الرابط | اسم جديد معى صيغه الملف).
2. ارسل صوره اختياريه لواجهه الملف (اختياري).
3. اضغط علي الازرار.
   SVideo - يعطيك ملف كا فيديو معى الصور
   DFile  - يعطيك ملف معى صور
   Video  - يعطيك الملف كا فيديو بدون صور
   DFile  - يعطيك ملف بدون صور

جروب الدعم : @TroJanzSupport
"""

    FORMAT_SELECTION = """حدد التنسيق المطلوب: <a href='{}'>قد يكون حجم الملف تقريبيًا</a>
    
إرسال الصورة المصغرة المخصصة الخاصة بك إذا لزم الأمر.
يمكنك استخدام /deletethumbnail لحذف الصورة المصغرة التي تم إنشاؤها تلقائيًا."""
    
    SET_CUSTOM_USERNAME_PASSWORD = """إذا كنت ترغب في تنزيل مقاطع فيديو متميزة, تقدم بالتنسيق التالي:
الرابط | اسم ملف جديد | اسم المستخدم | كلمه السر"""


    UPGRADE_TEXT = "<b>👉 اصنع بوتك الخاص.. </b>  \n\n<a href='https://github.com/prgofficial/URLuploader-With-Hotstar'>اضغط هنا لتحفظ المشروع و تصنع بوتك!!</a>"
    
    DOWNLOAD_START = "جاري تحميل ملفك..."
    
    UPLOAD_START = "جاري ارسال ملفك.."
    
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "تم التحميل في {} ثانيه. \n\تم الارسال في {} ثانيه."

    RCHD_TG_API_LIMIT = "تم التحميل في {} ثانيه.\حجم الملف المكتشف: {}\اسف. لكن, لا يمكنني تحميل ملفات أكبر من 1.95 جيجابايت بسبب قيود Telegram API."

    SAVED_CUSTOM_THUMB_NAIL = "تم حفظ الصورة المصغرة المخصصة. سيكون هذا دائمًا.\n\استخدم /deletethumbnail لازالتها."

    DEL_ETED_CUSTOM_THUMB_NAIL = "تم مسح الصورة المصغرة المخصصة بنجاح."

    CUSTOM_CAPTION_UL_FILE = " "

    SLOW_URL_DECED = "يا انت يبدو أنه عنوان URL بطيء جدًا. منذ أن كنت تخرب منزلي, أنا لست في حالة مزاجية لتحميل هذا الملف. في غضون ذلك ، لماذا لا تجرب هذا:==> https://shrtz.me/PtsVnf6 واحصل لي على عنوان URL سريع حتى أتمكن من التحميل إلى Telegram, دون أن أبطأ للمستخدمين الآخرين."

    NO_VOID_FORMAT_FOUND = "خطا...\n<b>YouTubeDL</b> يقول: {}"
